Бухгалтерские_задачи_Финиш/src/Documents/ПолучениеДенежныхСредств/ПолучениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолучениеДенежныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаХраненияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвижениеДенежныхСредств</name>
    <type>
      <types>CatalogRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_Финиш/src/Documents/ПолучениеДенежныхСредств/Forms/ФормаДокумента/Module.bsl
//---
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОрганизацияПриИзмененииНаСервере();
	КорСчетПриИзмененииНаСервере();
	МестоХраненияДенежныхСредствПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ПФО_Организация", Объект.Организация));

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КорСчетПриИзмененииНаСервере()

	ДанныеСчета = ОбщийМодульНаСервереВызовСКлиента.ПолучитьСвойствоСчета(Объект.КорСчет);

	Для Индекс = 1 По ДанныеСчета.МаксКоличествоСубконто Цикл

		Если (Индекс <= ДанныеСчета.КоличествоСубконто) Тогда

			Элементы["КорСубконто" + Индекс].Доступность = Истина;
			Элементы["КорСубконто" + Индекс].Заголовок = ДанныеСчета["ВидСубконто"
				+ Индекс + "Наименование"];
			Элементы["КорСубконто" + Индекс].ВыбиратьТип = Ложь;

			Объект["КорСубконто" + Индекс] = ДанныеСчета["ВидСубконто" + Индекс
				+ "ТипЗначения"].ПривестиЗначение(Объект.КорСубконто1);

		Иначе

			Элементы["КорСубконто" + Индекс].Доступность = Ложь;
			Элементы["КорСубконто" + Индекс].Заголовок = "Не определено";

			Объект["КорСубконто" + Индекс] = Неопределено;

		КонецЕсли;

	КонецЦикла;

	Если (ДанныеСчета.КоличествоСубконто = 2) Тогда

		Массив = Новый Массив;

		Если ТипЗнч(Объект.КорСубконто2) = Тип("СправочникСсылка.ЗначенияПользовательскихСубконто") Тогда

			Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеСчета.ВидСубконто2));

		ИначеЕсли ТипЗнч(Объект.КорСубконто2) = Тип("СправочникСсылка.Договоры") Тогда

			Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.КорСубконто1));
			Массив.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));

		КонецЕсли;

		Элементы.КорСубконто2.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	КорСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МестоХраненияДенежныхСредствПриИзмененииНаСервере()

	Если (ПолучитьФункциональнуюОпцию("ВалютныйУчет",
	 Новый Структура("ПФО_Организация", Объект.Организация)) = Истина) Тогда

		ДанныеСчета = ОбщийМодульНаСервереВызовСКлиента.ПолучитьСвойствоСчета(Объект.МестоХраненияДенежныхСредств.СчетУчета);

		Если (ДанныеСчета.Валютный = Истина) Тогда
			Элементы.Валюта.Видимость = Истина
		Иначе
			Элементы.Валюта.Видимость = Ложь
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияДенежныхСредствПриИзменении(Элемент)
	
	МестоХраненияДенежныхСредствПриИзмененииНаСервере();
	
КонецПроцедуры
